Repository: QCassa-com/QuantumAE.API
Catalog: src/QuantumAE.API/Validation/Resources/ValidationMessages.*.resx
Languages: de, hu

# Required
source: The field '{0}' is required.
de: Das Feld '{0}' ist erforderlich.
hu: A(z) '{0}' mező kitöltése kötelező.

# Required_Simple
source: {0} is required.
de: {0} ist erforderlich.
hu: {0} megadása kötelező.

# RequiredIfEmpty
source: Either '{0}' or '{1}' must be provided.
de: Entweder '{0}' oder '{1}' muss angegeben werden.
hu: A(z) '{0}' vagy '{1}' mező egyikét ki kell tölteni.

# NotEmptyString
source: The field '{0}' must not be empty or whitespace.
de: Das Feld '{0}' darf nicht leer sein oder nur Leerzeichen enthalten.
hu: A(z) '{0}' mező nem lehet üres vagy csak szóközöket tartalmazó.

# PositiveDecimal
source: The field '{0}' must be positive.
de: Das Feld '{0}' muss positiv sein.
hu: A(z) '{0}' mező értékének pozitívnak kell lennie.

# PositiveDecimal_AllowZero
source: The field '{0}' must be zero or positive.
de: Das Feld '{0}' muss null oder positiv sein.
hu: A(z) '{0}' mező értékének nullának vagy pozitívnak kell lennie.

# PositiveDecimal_NotNumeric
source: The field '{0}' must be a numeric type.
de: Das Feld '{0}' muss ein numerischer Typ sein.
hu: A(z) '{0}' mező értékének számnak kell lennie.

# StringLength_Max
source: The field '{0}' must not exceed {1} characters.
de: Das Feld '{0}' darf maximal {1} Zeichen lang sein.
hu: A(z) '{0}' mező legfeljebb {1} karakter lehet.

# StringLength_Range
source: The field '{0}' must be between {1} and {2} characters.
de: Das Feld '{0}' muss zwischen {1} und {2} Zeichen lang sein.
hu: A(z) '{0}' mező {1} és {2} karakter közötti hosszúságú lehet.

# Range
source: The field '{0}' must be between {1} and {2}.
de: Das Feld '{0}' muss zwischen {1} und {2} liegen.
hu: A(z) '{0}' mező értékének {1} és {2} között kell lennie.

# Min
source: The field '{0}' must be at least {1}.
de: Das Feld '{0}' muss mindestens {1} betragen.
hu: A(z) '{0}' mező értékének legalább {1} kell lennie.

# Min_Exclusive
source: The field '{0}' must be greater than {1}.
de: Das Feld '{0}' muss größer als {1} sein.
hu: A(z) '{0}' mező értékének nagyobbnak kell lennie, mint {1}.

# Max
source: The field '{0}' must be at most {1}.
de: Das Feld '{0}' darf höchstens {1} betragen.
hu: A(z) '{0}' mező értéke legfeljebb {1} lehet.

# Max_Exclusive
source: The field '{0}' must be less than {1}.
de: Das Feld '{0}' muss kleiner als {1} sein.
hu: A(z) '{0}' mező értékének kisebbnek kell lennie, mint {1}.

# ApNumber
source: The field '{0}' must be a valid AP number (9 characters: first letter B-X, followed by 8 digits).
de: Das Feld '{0}' muss eine gültige AP-Nummer sein (9 Zeichen: erster Buchstabe B-X, gefolgt von 8 Ziffern).
hu: A(z) '{0}' mező érvényes AP szám kell legyen (9 karakter: első betű B-X, utána 8 számjegy).

# Order_RequestIdRequired
source: RequestId is required.
de: RequestId ist erforderlich.
hu: A RequestId megadása kötelező.

# Order_OrderIdRequired
source: OrderId is required.
de: OrderId ist erforderlich.
hu: Az OrderId megadása kötelező.

# Order_ItemRequired
source: Item is required.
de: Artikel ist erforderlich.
hu: A tétel megadása kötelező.

# Order_CustomerRequired
source: Customer is required for invoice.
de: Kundendaten sind für die Rechnung erforderlich.
hu: A vevő adatai kötelezőek számlához.

# Order_ReturnInfoRequired
source: ReturnInfo is required for return document.
de: Retoureninformation ist für den Retourenbeleg erforderlich.
hu: A visszáru információ kötelező visszáru bizonylathoz.

# Order_StornoInfoRequired
source: StornoInfo is required for storno document.
de: Stornoinformation ist für den Stornobeleg erforderlich.
hu: A sztornó információ kötelező sztornó bizonylathoz.

# Order_FuelCardCloseRequired
source: FuelCardClose is required for fuel card document.
de: FuelCardClose ist für den Tankkarten-Beleg erforderlich.
hu: A FuelCardClose információ kötelező üzemanyagkártya bizonylathoz.

# Order_NameOrBarcodeRequired
source: Either Name or Barcode must be provided.
de: Entweder Name oder Barcode muss angegeben werden.
hu: A név vagy vonalkód egyikét meg kell adni.
